package com.javarush.test.level05.lesson12.home04;

/* Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 02 2014".
*/

public class Solution
{
    public static void main(String[] args)
    {
        int d = 10;
        int m = 11;
        int y = 2014;

        System.out.println(d + " " + m + " " + y);


        //Напишите тут ваш код
    }
}
